#!/usr/bin/env python

# Бабушка Зина любит печь блины своему любимому внуку Васе.
# А внук Вася любит математику и знает, что периметр и площадь блина можно найти по диаметру сковородки.
# Напишите программу, которая поможет Васе проверить его вычисления.

from math import pi
def perimeter(diameter):
    d = pi * d
    if d > 0:
        return d
    else:
        print('Нужна сковородка побольше')


def square(diameter):
    t = pi * (d / 2) ** 2
    if d > 0:
        return t
    else:
        print('Нужна сковородка побольше')


